benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.477ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.48ms  689.88us   7.06ms   68.29%
    Req/Sec    35.89k     2.21k   42.78k    67.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.89ms
 90.000%    2.49ms
 99.000%    3.22ms
 99.900%    4.18ms
 99.990%    5.11ms
 99.999%    5.88ms
100.000%    7.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.038     0.000000            1         1.00
       0.675     0.100000        67056         1.11
       0.887     0.200000       134255         1.25
       1.051     0.300000       201263         1.43
       1.208     0.400000       268475         1.67
       1.362     0.500000       335531         2.00
       1.443     0.550000       368840         2.22
       1.532     0.600000       402352         2.50
       1.632     0.650000       435895         2.86
       1.748     0.700000       469370         3.33
       1.891     0.750000       502887         4.00
       1.973     0.775000       519690         4.44
       2.059     0.800000       536525         5.00
       2.149     0.825000       553249         5.71
       2.249     0.850000       570084         6.67
       2.361     0.875000       586828         8.00
       2.427     0.887500       595183         8.89
       2.495     0.900000       603575        10.00
       2.565     0.912500       611826        11.43
       2.639     0.925000       620242        13.33
       2.717     0.937500       628505        16.00
       2.759     0.943750       632771        17.78
       2.803     0.950000       636930        20.00
       2.851     0.956250       641151        22.86
       2.903     0.962500       645362        26.67
       2.961     0.968750       649560        32.00
       2.993     0.971875       651608        35.56
       3.027     0.975000       653721        40.00
       3.061     0.978125       655757        45.71
       3.099     0.981250       657833        53.33
       3.141     0.984375       660019        64.00
       3.161     0.985938       661003        71.11
       3.185     0.987500       662059        80.00
       3.209     0.989062       663078        91.43
       3.237     0.990625       664149       106.67
       3.269     0.992188       665212       128.00
       3.287     0.992969       665720       142.22
       3.309     0.993750       666252       160.00
       3.337     0.994531       666754       182.86
       3.381     0.995313       667270       213.33
       3.471     0.996094       667783       256.00
       3.537     0.996484       668056       284.44
       3.607     0.996875       668314       320.00
       3.669     0.997266       668570       365.71
       3.749     0.997656       668836       426.67
       3.857     0.998047       669093       512.00
       3.915     0.998242       669222       568.89
       3.983     0.998437       669353       640.00
       4.047     0.998633       669485       731.43
       4.111     0.998828       669617       853.33
       4.187     0.999023       669747      1024.00
       4.235     0.999121       669822      1137.78
       4.275     0.999219       669877      1280.00
       4.327     0.999316       669944      1462.86
       4.383     0.999414       670008      1706.67
       4.439     0.999512       670074      2048.00
       4.467     0.999561       670106      2275.56
       4.503     0.999609       670141      2560.00
       4.543     0.999658       670172      2925.71
       4.595     0.999707       670205      3413.33
       4.695     0.999756       670239      4096.00
       4.739     0.999780       670254      4551.11
       4.787     0.999805       670271      5120.00
       4.851     0.999829       670286      5851.43
       4.971     0.999854       670304      6826.67
       5.015     0.999878       670320      8192.00
       5.079     0.999890       670327      9102.22
       5.147     0.999902       670336     10240.00
       5.191     0.999915       670343     11702.86
       5.231     0.999927       670351     13653.33
       5.299     0.999939       670360     16384.00
       5.327     0.999945       670364     18204.44
       5.339     0.999951       670368     20480.00
       5.371     0.999957       670372     23405.71
       5.491     0.999963       670377     27306.67
       5.503     0.999969       670380     32768.00
       5.515     0.999973       670382     36408.89
       5.567     0.999976       670384     40960.00
       5.603     0.999979       670386     46811.43
       5.695     0.999982       670388     54613.33
       5.775     0.999985       670390     65536.00
       5.835     0.999986       670391     72817.78
       5.859     0.999988       670392     81920.00
       5.879     0.999989       670394     93622.86
       5.879     0.999991       670394    109226.67
       5.883     0.999992       670395    131072.00
       5.919     0.999993       670396    145635.56
       5.919     0.999994       670396    163840.00
       5.923     0.999995       670397    187245.71
       5.923     0.999995       670397    218453.33
       6.271     0.999996       670398    262144.00
       6.271     0.999997       670398    291271.11
       6.271     0.999997       670398    327680.00
       6.667     0.999997       670399    374491.43
       6.667     0.999998       670399    436906.67
       6.667     0.999998       670399    524288.00
       6.667     0.999998       670399    582542.22
       6.667     0.999998       670399    655360.00
       7.059     0.999999       670400    748982.86
       7.059     1.000000       670400          inf
#[Mean    =        1.478, StdDeviation   =        0.690]
#[Max     =        7.056, Total count    =       670400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  987817 requests in 30.00s, 122.47MB read
Requests/sec:  32926.11
Transfer/sec:      4.08MB