benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-settle.txt
Running 5s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  577.60us   4.85ms   64.46%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.72ms
 90.000%    2.13ms
 99.000%    2.74ms
 99.900%    3.15ms
 99.990%    4.53ms
 99.999%    4.82ms
100.000%    4.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            1         1.00
       0.605     0.100000         9690         1.11
       0.772     0.200000        19432         1.25
       0.928     0.300000        29139         1.43
       1.074     0.400000        38793         1.67
       1.230     0.500000        48451         2.00
       1.312     0.550000        53332         2.22
       1.395     0.600000        58148         2.50
       1.489     0.650000        62969         2.86
       1.598     0.700000        67843         3.33
       1.717     0.750000        72684         4.00
       1.779     0.775000        75102         4.44
       1.842     0.800000        77503         5.00
       1.911     0.825000        79945         5.71
       1.980     0.850000        82361         6.67
       2.051     0.875000        84807         8.00
       2.087     0.887500        85988         8.89
       2.127     0.900000        87214        10.00
       2.167     0.912500        88434        11.43
       2.209     0.925000        89634        13.33
       2.253     0.937500        90829        16.00
       2.279     0.943750        91456        17.78
       2.307     0.950000        92058        20.00
       2.339     0.956250        92655        22.86
       2.379     0.962500        93246        26.67
       2.437     0.968750        93860        32.00
       2.469     0.971875        94154        35.56
       2.507     0.975000        94459        40.00
       2.545     0.978125        94764        45.71
       2.583     0.981250        95060        53.33
       2.633     0.984375        95365        64.00
       2.661     0.985938        95514        71.11
       2.689     0.987500        95665        80.00
       2.717     0.989062        95814        91.43
       2.751     0.990625        95975       106.67
       2.785     0.992188        96120       128.00
       2.813     0.992969        96198       142.22
       2.843     0.993750        96269       160.00
       2.869     0.994531        96346       182.86
       2.897     0.995313        96422       213.33
       2.927     0.996094        96496       256.00
       2.943     0.996484        96533       284.44
       2.963     0.996875        96573       320.00
       2.987     0.997266        96610       365.71
       3.021     0.997656        96647       426.67
       3.053     0.998047        96686       512.00
       3.063     0.998242        96705       568.89
       3.077     0.998437        96722       640.00
       3.095     0.998633        96741       731.43
       3.125     0.998828        96760       853.33
       3.157     0.999023        96780      1024.00
       3.171     0.999121        96788      1137.78
       3.181     0.999219        96800      1280.00
       3.197     0.999316        96807      1462.86
       3.219     0.999414        96817      1706.67
       3.241     0.999512        96827      2048.00
       3.265     0.999561        96831      2275.56
       3.297     0.999609        96836      2560.00
       3.363     0.999658        96840      2925.71
       3.467     0.999707        96845      3413.33
       3.871     0.999756        96850      4096.00
       3.925     0.999780        96852      4551.11
       4.037     0.999805        96855      5120.00
       4.295     0.999829        96857      5851.43
       4.435     0.999854        96859      6826.67
       4.507     0.999878        96862      8192.00
       4.535     0.999890        96863      9102.22
       4.563     0.999902        96864     10240.00
       4.579     0.999915        96865     11702.86
       4.595     0.999927        96866     13653.33
       4.603     0.999939        96868     16384.00
       4.603     0.999945        96868     18204.44
       4.623     0.999951        96869     20480.00
       4.623     0.999957        96869     23405.71
       4.695     0.999963        96870     27306.67
       4.763     0.999969        96871     32768.00
       4.763     0.999973        96871     36408.89
       4.763     0.999976        96871     40960.00
       4.763     0.999979        96871     46811.43
       4.815     0.999982        96872     54613.33
       4.815     0.999985        96872     65536.00
       4.815     0.999986        96872     72817.78
       4.815     0.999988        96872     81920.00
       4.815     0.999989        96872     93622.86
       4.855     0.999991        96873    109226.67
       4.855     1.000000        96873          inf
#[Mean    =        1.306, StdDeviation   =        0.578]
#[Max     =        4.852, Total count    =        96873]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  96874 requests in 5.00s, 12.01MB read
Requests/sec:  19374.70
Transfer/sec:      2.40MB